n = int(input ('Введите номер месяца: '))

if n==1:
    print('Вы ввели январь. 31 день')
elif n==2:
    print('Выввели февраль. 28 дней')
elif n==3:
    print('Вы ввели март. 31 день')
elif n==4:
    print('Вы ввели апрель. 30 дней')
elif n==5:
    print('Вы ввели май. 31 день')
elif n==6:
    print('Выввели февраль. 30 дней')
elif n==7:
    print('Вы ввели март. 31 день')
elif n==8:
    print('Вы ввели апрель. 31 дней')
elif n==9:
    print('Вы ввели май. 30 день')
elif n==10:
    print('Выввели февраль. 31 дней')
elif n==11:
    print('Вы ввели март. 30 день')
elif n==12:
    print('Вы ввели апрель. 31 дней')
else:
    print('Такого месяца нет')


    